<template>
  <div class="container mt-3">
    <h1 class="title">Пользовательское соглашение</h1>
    <div class="terms">
      <p>
        Используя сайт
        <router-link :to="{ name: 'homepage' }">Check Me Now</router-link>
        (далее Сайт), Вы подтверждаете, что прочитали, поняли и согласны
        соблюдать настоящее Соглашение об использовании (далее - Соглашение).
        Администрация Сайта (далее - Администрация) оставляет за собой право
        изменять и дополнять настоящее Соглашение в любое время без
        предварительного и/или последующего уведомления Пользователя.
        Администрация публикует изменения и дополнения в Соглашении на данной
        странице, Вы обязуетесь самостоятельно следить за изменениями и
        дополнениями, вносимыми Администрацией в Соглашение.
      </p>
      <div class="alert alert-warning mt-1 row" role="alert">
        <div class="d-flex">
          <div class="mr-3">
            <i
              class="fas fa-exclamation-triangle mr-2 mt-2"
              style="font-size: 30px"
            ></i>
          </div>
          <div>
            <p class="mb-1">
              В случае Вашего несогласия с условиями, указанными в
              нижеприведенных пунктах, Вы должны немедленно отказаться от
              использования этого веб-сайта и покинуть его страницы.
            </p>
          </div>
        </div>
      </div>
      <ol>
        <li>
          Сайт предоставляет Пользователю сервисы для создания, публикации и
          прохождения онлайн тестов, опросов, кроссвордов, логических игр. А
          также дополнительные сервисы для удобства организации работы с
          пользователями (учениками, студентами, респондентами).
        </li>
        <li>
          Для использования сервисов Сайта или некоторых отдельных функций и
          сервисов, Пользователю необходимо пройти процедуру регистрации, в
          результате которой для Пользователя будет создана уникальная учетная
          запись. При регистрации Пользователь указывает свой адрес электронной
          почты и пароль для доступа к учетной записи.
        </li>
        <li>
          Пользователь самостоятельно несет ответственность за соответствие
          содержания размещаемых Пользователем тестов, файлов и любой другой
          информации (далее Контент) на Сайте требованиям действующего
          законодательства, включая ответственность перед третьими лицами в
          случаях, когда размещение Пользователем того или иного контента или
          содержание контента нарушает права и законные интересы третьих лиц.
        </li>
        <li>
          Пользователь самостоятельно несет ответственность перед третьими
          лицами за свои действия, связанные с использованием сервисов, в том
          числе, если такие действия приведут к нарушению прав и законных
          интересов третьих лиц, а также за соблюдение законодательства при
          использовании сервисов.
        </li>
        <li>
          Кроме своего собственного Контента, Пользователь не вправе загружать
          или иным образом доводить до всеобщего сведения (публиковать на Сайте)
          Контент других сайтов, баз данных и прочих объектов исключительных
          прав при отсутствии явным образом выраженного согласия правообладателя
          на такие действия.
        </li>
        <li>
          Сайт и все сервисы Сайта, предоставляются "Как есть", Вы используете
          службы Сайта на Ваш собственный риск. Администрация не принимает на
          себя никакой ответственности, в том числе и за соответствие наших
          сервисов целям конечного Пользователя.
        </li>
        <li>
          Администрация не несет ответственности за любые прямые или косвенные
          убытки, ущерб компьютеру пользователя или иного лица произошедшие
          из-за использования либо невозможности использования Сайта.
        </li>
        <li>
          Администрация не гарантирует, что сервисы и доступ к Сайту будут
          предоставляться непрерывно, быстро, надежно и без ошибок.
        </li>
        <li>
          На сайте запрещено размещение материалов, содержащих:
          <ul>
            <li>
              угрозы или пропаганду против отдельного лица, группы, организации,
            </li>
            <li>порнографическое содержание,</li>
            <li>
              элементы насилия, пропаганды наркотических и психотропных веществ,
            </li>
            <li>
              пропаганду расовой, религиозной, этнической ненависти или вражды,
            </li>
            <li>непристойный, вульгарный текст и нецензурные выражения,</li>
            <li>
              коммерческую рекламу, коммерческие предложения, агитационные
              материалы, спам,
            </li>
            <li>
              любую иную информацию, нарушающую охраняемые законом права
              человека и гражданина.
            </li>
          </ul>
        </li>
      </ol>
    </div>
  </div>
</template>

<script>
export default {
  name: "CmnTerms",
};
</script>

<style scoped>
.terms {
  font-size: 18px;
}
</style>